%%
the=pi/3;phi=pi/4;psi=pi/6;
x=[3;2;7;1];
Rx=[1 0 0 0;0 cos(the) -sin(the) 0;0 sin(the) cos(the) 0;0 0 0 1];
Ry=[cos(phi) 0 sin(phi) 0;0 1 0 0;-sin(phi) 0 cos(phi) 0;0 0 0 1];
Rz=[cos(psi) -sin(psi) 0 0;sin(psi) cos(psi) 0 0;0 0 1 0;0 0 0 1];
T1=[1 0 0 3;0 1 0 0;0 0 1 -4;0 0 0 1];
T3=[1 0 0 6;0 1 0 6;0 0 1 6;0 0 0 1];
T5=[1 0 0 0;0 1 0 -3;0 0 1 5;0 0 0 1];
y=Rz*T5*Ry*T3*Rx*T1*x

%%
x3=[0 1 1 1 1 1 1 4 4 4 7 7 7 7 7 7 8 8 8 8 8 8 7 7 7 4 4 4 1 1 1 0 0 0 0 0 1 1 4 7 7 8 8 7 4 1 0 0;...
    0 0 0 0 6 6 6 0 0 0 6 6 6 0 0 0 0 0 0 8 8 8 8 8 8 2 2 2 8 8 8 8 8 8 0 0 0 6 0 6 0 0 8 8 2 8 8 0;...
    0 0 1 0 0 1 0 0 1 0 0 1 0 0 1 0 0 1 0 0 1 0 0 1 0 0 1 0 0 1 0 0 1 0 0 1 1 1 1 1 1 1 1 1 1 1 1 1;
    1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1];
figure(3);clf;grid on;

%% 각각 따로
for the=0:0.05:pi/4
   Rx=[1 0 0 0;0 cos(the) -sin(the) 0;0 sin(the) cos(the) 0;0 0 0 1];
   y3=Rx*x3;
   clf;
   line(y3(1,:),y3(2,:),y3(3,:));
   axis([-10 10 -10 10 -10 10]);grid on;
   pause(0.0001);
end

for phi=0:0.05:pi/3
   Ry=[cos(phi) 0 sin(phi) 0;0 1 0 0;-sin(phi) 0 cos(phi) 0;0 0 0 1];
   yy=Ry*x3;
   clf;
   line(yy(1,:),yy(2,:),yy(3,:));
   axis([-10 10 -10 10 -10 10]);grid on;
   pause(0.0001);
end

for psi=0:0.05:pi/2
   Rz=[cos(psi) -sin(psi) 0 0;sin(psi) cos(psi) 0 0;0 0 1 0;0 0 0 1];
   yyy=Rz*x3;
   clf;
   line(yyy(1,:),yyy(2,:),yyy(3,:));
   axis([-10 10 -10 10 -10 10]);grid on;
   pause(0.0001);
end

%% 
d=[0 5 5 0 -5 5 0 -5 -5 0 5 -5 0;...
    0 -5 5 0 5 5 0 5 -5 0 -5 -5 0;...
    20 0 0 20 0 0 -20 0 0 -20 0 0 20;...
    1 1 1 1 1 1 1 1 1 1 1 1 1];
figure(5);clf;line(d(1,:),d(2,:),d(3,:))
view([45 45 45])

%%

d=[0 5 5 0 -5 5 0 -5 -5 0 5 -5 0;...
    0 -5 5 0 5 5 0 5 -5 0 -5 -5 0;...
    20 0 0 20 0 0 -20 0 0 -20 0 0 20;...
    1 1 1 1 1 1 1 1 1 1 1 1 1];
% p의 각각은 벡터번호를 의미
p=[1 2 3;4 5 6;5 6 7;8 9 10;9 10 11;11 12 13;1 8 9;2 3 7];
c=['b';'r';'g';'w';'k';'c';'m';'y'];

for psi=0:0.04:2*pi
    clf;
   Rz=[cos(psi) -sin(psi) 0 0;sin(psi) cos(psi) 0 0;0 0 1 0;0 0 0 1];
   y=Rz*d;
   
   line(y(1,:),y(2,:),y(3,:));
   for i=1:1:8
       %각 면에 색 부여
      patch([y(1,p(i,1)) y(1,p(i,2)) y(1,p(i,3))], [y(2,p(i,1)) y(2,p(i,2)) y(2,p(i,3))],...
          [y(3,p(i,1)) y(3,p(i,2)) y(3,p(i,3))],c(i));
   end
   
   line([60 0 0],[0 0 0],[0 0 0],'color','r');
   line([0 0 0],[0 60 0],[0 0 0],'color','g');
   line([0 0 0],[0 0 0],[0 0 60],'color','k');
   xlabel('x1 axis');ylabel('x2 axis');zlabel('x3 axis');
   axis([-60 60 -60 60 -60 60]);
   view([60,60,60]);grid;
   pause(0.000001);
end